import 'fack_data.dart';

class BlogModel {
  int id;
  String imageUrl;
  String title;
  String writer;
  String writerImageUrl;
  String data;
  String content;
  String views;

  BlogModel({
    required this.id,
    required this.title,
    required this.imageUrl,
    required this.content,
    required this.data,
    required this.views,
    required this.writerImageUrl,
    required this.writer,
  });
}

List<BlogModel> blogList = [
  BlogModel(
      id: 1,
      title: "آیا فضا در جایی به پایان می‌رسد؟",
      imageUrl:
          "https://parispeaceforum.org/wp-content/uploads/2021/10/NET-ZERO-SPACE-INITIATIVE-1.png",
      content:
          """اگر ستاره‌ها را مثل خانه در نظر بگیریم، کهکشان‌ها مثل شهرهای پر از خانه هستند. دانشمندان تخمین می‌زنند که فقط صد میلیارد ستاره در کهکشان راه شیری که میزبان سیاره ما زمین است وجود دارد.

اگر بتوانید به طریقی بسیار فراتر از کهکشان راه شیری بزرگ‌نمایی کنید، آن صد میلیارد ستاره با هم یکی می‌شوند، مثل موقعی که نورهای ساختمان‌های شهر را هنگام مشاهده از هواپیما به صورت یکپارچه می‌بینیم.

فقط برای رسیدن به یک کهکشان دیگر، لازم است انسان میلیون‌ها تریلیون کیلومتر در فضا سفر کند. بیشتر این فضا تقریباً به طور کامل خالی است، و تنها چند مولکول سرگردان و ذرات مرموز کوچک که دانشمندان آن را «ماده تاریک» می‌نامند در این فضای لایتناهی وجود دارد.

عموم دانشمندان فکر می‌کنند که ا""",
      data: "دو هفته پیش",
      views: "133",
      writerImageUrl: "fg",
      writer: "احسان غفوری"),
  ////////////////////////////////////////////////////////////////////////////
  BlogModel(
      id: 2,
      title:
          "ایلان ریو ماسک FRS (انگلیسی: Elon Reeve Musk؛ زادهٔ ۲۸ ژوئن ۱۹۷۱) ",
      imageUrl:
          "https://upload.wikimedia.org/wikipedia/commons/thumb/8/85/Elon_Musk_Royal_Society_%28crop1%29.jpg/220px-Elon_Musk_Royal_Society_%28crop1%29.jpg",
      content:
          """ایلان ریو ماسک FRS (انگلیسی: Elon Reeve Musk؛ زادهٔ ۲۸ ژوئن ۱۹۷۱) یک کارآفرین و شخص نامی در زمینهٔ تجارت است. او بنیان‌گذار، مدیرعامل و مهندس ارشد اسپیس‌اکس؛ سرمایه‌گذار، مدیرعامل و طراح محصولات تسلا، آی‌ان‌سی.؛ بنیان‌گذار د بورینگ کمپانی؛ یکی از بنیان‌گذاران مشترک نیورالینک و اوپن‌ای‌آی و مالک توئتر است. ماسک با دارایی خالص حدود ۲۷۰ میلیارد دلار تا دسامبر ۲۰۲۱،[۴] ثروتمندترین شخص جهان بوده‌است.

ماسک از مادری کانادایی و پدری از آفریقای جنوبی زاده شد و در پرتوریا، آفریقای جنوبی بزرگ شد. او مدت کوتاهی در دانشگاه پرتوریا تحصیل کرد و سپس در ۱۷ سالگی برای حضور در دانشگاه کویینز به کانادا نقل مکان کرد. او دو سال بعد به دانشگاه پنسیلوانیا رفت و در آن جا لیسانس اقتصاد و فیزیک خود را دریافت کرد. او در سال ۱۹۹۵ برای تحصیل در دانشگاه استنفورد به کالیفرنیا نقل مکان کرد اما تصمیم گرفت که به دنبال کار حرفه‌ای، شرکت نرم‌افزار وب زیپ۲ را با برادرش کیمبال تأسیس کند. این شرکت نوپا در سال ۱۹۹۹ با قیمت ۳۰۷ میلیون دلار توسط شرکت کامپک خریداری شد. ماسک همان سال به صورت مشترک بانک آنلاین X.com را تأسیس کرد که در سال ۲۰۰۰ با کنفینیتی ادغام شد و پی‌پل را تشکیل داد. این """,
      data: "دو روز پیش",
      views: "911",
      writerImageUrl: "h",
      writer: "ملیکا عزیزی"),
  /////////////////////////////////////////////////////////////////////////////////////
  BlogModel(
      id: 3,
      title: "  مدیریت و کنترل ذهن_ هوش ثروت",
      imageUrl:
          "https://hosheservat.com/wp-content/uploads/2020/01/%D9%86%D8%A7%D8%AE%D9%88%D8%AF%D8%A2%DA%AF%D8%A7%D9%87-nlp.png",
      content: """تسلط و مدیریت ذهن چیست ؟؟

مغز و ذهن با اهمیت ترین عضو بدن هر انسان می باشد . تمام کارها و رفتارهای ما از ذهن سرچشمه می گیرد . وقتی که ما توانایی ریاست و کنترل ذهن خود را داشته باشیم و افکار و باورها را مدیریت کنیم مدیریت ذهن انجام داده ایم . باتسلط بر ذهن می توانیم کارها و اتفاقاتی که در زندگی پیش می آید را کنترل کنیم و به تمام خواسته های دلخواهمان نیز برسیم .

ذهن خود را بشناسیم ، آن وقت است که ذهن دستاوردها و رفتارهای جدیدی را برای ما خواهد آفرید .

 

ذهن به چه معناست ؟

اگر مغزمان را یک رایانه در نظر بگیریم کل مغز سخت افزار این رایانه است و ذهن هم برنامه های اجرایی و نرم افزار آن تلقی می شود .برای کارکردهای مغز از کلمه ی ذهن استفاده می شود . هر انسانی می تواند فعالیتهای بسیار زیاد و متفاوتی را یاد بگیرد و به انجام برساند و مسیرهای عصبی بسیار زیادی را بیافریند و به توانایی زیادی برسد . کافیست بخواهد.

طبق تحقیقات گذشته هر انسان نابغه ای فقط ده درصد از مغز خود استفاده کرده است و این درصد در افراد عادی کمتر است .

طبق تحقیقات جدید مغز و ذهن همه ی انسانها شبیه هم است و با بیشترین ظرفیت خود در حال فعالیت است ، تنها فرقی که وجود دارد نحوه و میزان استفاده هر شخص از ذهن و نحوه ی مدیریتی است که بر ذهن دارد و هر کسی که بخواهد می تواند بهترین استفاده و بهره را از مغز خود ببرد .با تکنولوژی که در زندگی اکنون وجود دارد هر انسانی بیشتر از قدرت ذهن خود استفاده می کند . بدلیل اثر زیاد ذهن روی روابط و شغل و زندگی افراد مدیریت و کنترل و تسلط روی ذهن بسیار مفید و تاثیرگذار خواهد بود و می توانیم به بسیاری از اهداف خود دست پیدا کنیم.

زمانی که ما زیادی درگیر گذشته و اتفاقات ناراحت کننده و بازدانده ی گذشته زندگی مان هستیم یعنی ذهن و ضمیرناخودآگاه مارا کنترل و هدایت می کند .

بسیاری از تصمیمات گرفته شده در اثر ضمیر ناخودآگاه ذهن ماست که بیشتر اوقات به آنها دسترسی نیست و وقتی که خیلی اوقات علت تصمیمات گرفته شده را نمی دانیم همین علت است.

پس در انجام هرکاری و قبل از هر تصمیمی بر ذهن خود مسلط شویم و بجای اینکه ذهن مارا کنترل کند خود کنترل امور و ذهن را در دست بگیریم .

مثال : قبل از شروع هرکاری نگرانی و اضطراب دارید و مدام پیام هایی دریافت می کنید که اگر در این کار موفق نشوی چه پیامدهایی دارد . این دلهره و نگرانی ها باعث می شود که مانع عملکرد شما شود.

وقتی که با کارکردهای ذهن آشنا شوید به این باور می رسید که چون مسیرعصبی آن کار یا یادگیری درحال ساخت هست این نگرانی ها واسترس ها کاملا طبیعی است و وقتی شما متوجه این باشید به ذهن اجازه ی بزرگ کردن موانع و ترس ها و اضطراب ها را نمی دهید و افکار منفی باعث جلوگیری از موفقیت و انجام ندادن نمی شود.

“هیچ وقت اجازه ندهید که ترس از آینده ای که هنوز نیامده و شکست ها و موانع مانع از تلاش نکردن شود “

 """,
      data: "یک هفته پیش",
      views: "343",
      writerImageUrl: "h",
      writer: "محود صادقی"),

  ///////////////////////////////////////////////////////////////////////////////////////
  BlogModel(
      id: 4,
      title: " بیوگرافی مسعود اوزیل بازیکن فوتبال + زندگی و همسرش",
      imageUrl:
          "https://photokade.com/wp-content/uploads/masoudozil-photokade-2.jpg",
      content:
          """شایعات مختلفی وجود دارد که پدرش به احترام مسعود بارزانی ناسیونالیسم کرد اسم او را مسعود گذاشته اما در هیچ رسانه ای این خبر تایید نشده است",
""",
      data: "امروز",
      views: "406",
      writerImageUrl: "h",
      writer: "بابک امیری"),
  ///////////////////////////////////////////////////////
  BlogModel(
      id: 5,
      title:
          " یک راه ساده برای تشخیص علمی بودن یا نبودن کتاب - انتشارات نارون دانش",
      imageUrl:
          "http://www.narvanpub.com/wp-content/uploads/2018/04/1280x800-nauchnaya-kniga.57f.jpg",
      content: """یک راه ساده برای تشخیص علمی بودن یا نبودن کتاب
ارزیابی کیفی کتاب هم در فرآیند چاپ کتاب اهمیت زیادی دارد و هم برای خوانندگان هنگام خرید یک کتاب. هم اکنون در بازار کتاب، کتابهای فراوانی با موضوعات مختلف وجود دارد. بسیاری از این کتابها حاوی عناوینی گاهاً جذاب هستند که بر اساس نیاز روز جامعه و افراد آن یا نگارش می‌شوند و یا از زبانهای مختلف ترجمه می‌گردند. مخاطبین بسیاری که برخی از این کتابها را مطالعه می‌کنند شاهد تعارضاتی در محتوا و پیام آنها هستند و یا اینکه آنها را با واقعیت حقیقی منطبق نمی‌دانند ولی از اینکه این پیام‌ها به صورت یک کتاب تهیه و منتشر شده است خوانندگان را به تردید می‌اندازد که آیا پیام‌های موجود در این کتابها اشکال دارند یا خود خواننده نمی‌تواند بهره لازم را بگیرد. برای مثال، کتابی که ادعا می‌کند در چند ثانیه مدیریت و استراتژی‌های آن را به خوانندگان یاد می‌دهد و یا اینکه کتاب دیگر اصول و نکاتی درباره رشد و تربیت کودک ذکر می‌کند آیا اینها واقعاً می‌توانند قابل استفاده باشند یا فقط جنبه بازاریابی یا فروش دارند. در زمینه کتابهای روانشناسی این مشکل بسیار مشخص‌تر می‌شود. مثلاً کتابی با یک عنوان جنجالی ادعا می‌کند که با چند تکنیک محدود، والدین کاملی برای فرزندان خود شوید. در این مطلب با طرح با عنوان یک راه ساده برای تشخیص علمی بودن یا نبودن کتاب به بررسی این سوال و پاسخ به آن پرداخته‌ایم که آیا تمامی کتابهای موجود در بازار می‌توانند علمی باشند یا خیر (بیشتر بخوانید: نگارش کتاب پر فروش و چند پیشنهاد عالی برای آن).

برای ثبت سفارش چاپ کتاب روی این لینک کلیک نمایید

یک راه ساده برای تشخیص علمی بودن یا نبودن کتاب
روش‌های مختلفی وجود دارد تا شما بتوانید میزان علمی بودن و یا علمی نبودن کتاب را ارزیابی کنید. اما در آغاز باید بدانیم منظور از صفت علمی چیست؟ به زبان ساده و کوتاه منظور از علمی بودن کتاب آن است که خواننده تا چه حد می‌تواند به آنچه در محتوای کتاب آمده اطمینان داشته باشد و اینکه تا چه حد پیام‌های موجود در کتاب قابلیت اتکا و اطمینان را دارند. علم با روش خود که به روش علمی معروف است بر اساس پژوهش‌ها و طرح‌های تحقیقی مختلف ملاک‌هایی برای کاوش و پژوهش مطرح کرده است که صرفاً نتایج آن پژوهش‌ها را به عنوان یافته‌های قابل اتکا قبول دارد و سندیت می‌دهد. بنابراین، هر فردی که ادعایی را مطرح می‌کند و یافته‌ای جدید را اظهار می‌دارد باید اثبات نماید از چه روشی و چگونه به این نتایج دست یافته است. در صورتی که روش و چگونگی دسترسی به آن مورد تایید علم و روش‌های قابل قبول آن بوده باشد یافته‌ها و نتایج مورد تایید جامعه علمی قرار می‌گیرند و در صورتی که اینگونه نباشد، یافته‌ها و نتایح آن فرد بی‌اساس و عیرکاربردی تلقی می‌شود.

ما نمی‌خواهیم شما را وارد پیچیدگی‌های علمی کنیم؛ ما در اینجا بعد از مطالعه وب سایت‌های مختلف یک راه ساده برای تشخیص علمی بودن یا نبودن کتاب برگزیده‌ایم که به نظر می‌رسد بسیار کاربردی و مفید باشد.

خواننده می‌تواند با رجوع به بخش رفرنس‌های کتاب مشاهده نماید که این کتاب آیا رفرنس دارد یا خیر. می‌توان تا حدودی با قطعیت اعلام نمود که کتابهایی که فهرست منایع ندارند نمی‌توانند علمی باشند. برای مثال هیچکدام از کتابهای رمان فهرست منابع ندارند زیرا ادعایی مبنی بر علمی بودن گفته‌های خود ندارند و مشکلی نیز ایجاد نمی‌کند. اما بسیاری از کتابهای دیگر با رنگ و لعاب علمی و آموزشی به بازار عرضه می‌شوند که متاسفانه مطالب آنها مستخرج یا حاصل از نتایج پزوهش‌های علمی نیست و می‌توان این کتابها را در زمره کتابهای رمان و داستانی قرار داد. مشاهده شده است که برخی از خوانندگان و علاقمندان کتاب با خواندن اینگونه کتابها دانشی بی پایه و اساس را فرا می‌گیزند که متاسفانه این دانش بی پایه و اساس را نیز در برخی رفتارهای خود ملاک عمل قرار می‌دهند و به هیچ عنوان هم حاضر نیستند تردیدی به خود راه دهند زیرا به قول خودشان این دانش را حاصل از مطالعه کتابهای مختلف در این زمینه کسب کرده‌اند.

بنابراین، وجود یا عدم وجود فهرست منابع قوی می‌تواند ملاک خوبی در ارزیابی علمی بودن و نبودن کتاب باشد. علاوه بر این، شما می‌توانید چند قدم جلوتر نیز بروید. شما می‌توانید رفرنس های موجود در کتاب را در اینترنت سرچ کرده و درباره انها نیز مطالعاتی انجام دهید. واقعیت مطلب این است برخی از رفرنسها نیز علمی نیستند! یعنی مقالات یا کتابهایی وجود دارد که خود آنها نیز ملاک علمی بودن را ندارند و استناد به این منابع نیز نمی‌تواند وجه علمی کتاب را تضمین کند.""",
      data: "پنج روز پیش",
      views: "370",
      writerImageUrl: "h",
      writer: "عاطفه علیپور")
];

List<PodcastModel> podcastList = [
  PodcastModel(
      id: 1,
      imageUrl:
          "https://imgv3.fotor.com/images/homepage-feature-card/Fotor-AI-photo-enhancement-tool.jpg",
      title: "دارما پادکست",
      writer: "الهه رعوفی"),
  PodcastModel(
      id: 2,
      imageUrl:
          "https://picjumbo.com/wp-content/uploads/woman-holding-an-american-flag-in-a-field-free-photo-1080x1620.jpg",
      title: " پادکست فضا",
      writer: "محمد رعوفی"),
  PodcastModel(
      id: 3,
      imageUrl:
          "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRPqo7Mj_V_rBe5-dOCFrvLcIehnRWb1LA20g&usqp=CAU",
      title: " مکست",
      writer: "امیر رعوفی"),
  PodcastModel(
      id: 4,
      imageUrl:
          "https://images.ctfassets.net/6m9bd13t776q/3kQerwaiPZg0MYmFTBWb2g/57e84805ed3348ae67ee2ef8478ea224/maternity-photo-ideas-pregnant-baby-animal-750x550.jpg?q=75",
      title: "دارما پادکست",
      writer: "الهه رعوفی"),
  PodcastModel(
      id: 5,
      imageUrl:
          "https://cloudfront-us-east-2.images.arcpublishing.com/reuters/F6INOOMSRRL5XOOQDRPZUWPWBA.jpg",
      title: " پادکست فضا",
      writer: "محمد رعوفی"),
  PodcastModel(
      id: 6,
      imageUrl:
          "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQzTTInJfqIMsT7mqPBrV7WzLwQFMqw3ISwRg&usqp=CAU",
      title: " مکست",
      writer: "امیر رعوفی"),
  PodcastModel(
      id: 7,
      imageUrl:
          "https://photo-net-production-images.s3.amazonaws.com/18581316-lg.jpg",
      title: "دارما پادکست",
      writer: "الهه رعوفی"),
  PodcastModel(
      id: 8,
      imageUrl:
          "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTJISlJx0WwSdY7Znf3bvuYP6aiC9BU8uDVYg&usqp=CAU",
      title: " پادکست فضا",
      writer: "محمد رعوفی"),
  PodcastModel(
      id: 9,
      imageUrl:
          "https://static.toiimg.com/thumb/msid-31346158,width-748,height-499,resizemode=4,imgsize-114461/.jpg",
      title: " مکست",
      writer: "امیر رعوفی"),
];
